In [2]:
import numpy as np
import pandas as pd
from pandas import DataFrame, Series

In [3]:
df = DataFrame({'k1': ['X', 'X', 'Y', 'Y', 'Z'],
               'k2': ['alpha', 'beta', 'alpha', 'beta', 'alpha'],
               'data1': np.random.randn(5),
               'data2': np.random.randn(5)})
df

  k1     k2     data1     data2
0  X  alpha -0.848790  1.114857
1  X   beta  0.681610 -0.129221
2  Y  alpha  2.080715 -0.923458
3  Y   beta -0.600653  2.113144
4  Z  alpha  0.033508  0.894159

In [4]:
group1 = df['data1'].groupby(df['k1'])
group1

In [5]:
group1.mean()

k1
X   -0.083590
Y    0.740031
Z    0.033508
Name: data1, dtype: float64

In [6]:
group1.sum()

k1
X   -0.167180
Y    1.480062
Z    0.033508
Name: data1, dtype: float64

In [7]:
cities = np.array(['NY', 'LA', 'LA', 'NY', 'NY'])
month = np.array(['JAN', 'FEB', 'JAN', 'FEB', 'JAN'])

In [8]:
df['data1'].groupby([cities, month]).mean()

LA  FEB    0.681610
    JAN    2.080715
NY  FEB   -0.600653
    JAN   -0.407641
Name: data1, dtype: float64

In [9]:
df.groupby('k1').mean()

       data1     data2
k1
X  -0.083590  0.492818
Y   0.740031  0.594843
Z   0.033508  0.894159

In [10]:
df.groupby(['k1', 'k2']).mean()

             data1     data2
k1 k2
X  alpha -0.848790  1.114857
   beta   0.681610 -0.129221
Y  alpha  2.080715 -0.923458
   beta  -0.600653  2.113144
Z  alpha  0.033508  0.894159

In [12]:
df.groupby('k1').size()

k1
X    2
Y    2
Z    1
dtype: int64

In [15]:
for name, group in df.groupby('k1'):
    print("This is the %s group" %name)
    print(group)
    print('\n')

This is the X group
  k1     k2    data1     data2
0  X  alpha -0.84879  1.114857
1  X   beta  0.68161 -0.129221


This is the Y group
  k1     k2     data1     data2
2  Y  alpha  2.080715 -0.923458
3  Y   beta -0.600653  2.113144


This is the Z group
  k1     k2     data1     data2
4  Z  alpha  0.033508  0.894159

In [16]:
for (k1, k2), group in df.groupby(['k1', 'k2']):
    print("Key1 = %s Key2 = %s" %(k1,k2))
    print(group)
    print('\n')

Key1 = X Key2 = alpha
  k1     k2    data1     data2
0  X  alpha -0.84879  1.114857


Key1 = X Key2 = beta
  k1    k2    data1     data2
1  X  beta  0.68161 -0.129221


Key1 = Y Key2 = alpha
  k1     k2     data1     data2
2  Y  alpha  2.080715 -0.923458


Key1 = Y Key2 = beta
  k1    k2     data1     data2
3  Y  beta -0.600653  2.113144


Key1 = Z Key2 = alpha
  k1     k2     data1     data2
4  Z  alpha  0.033508  0.894159

In [17]:
group_dict = dict(list(df.groupby('k1')))
group_dict

{'X':   k1     k2    data1     data2
 0  X  alpha -0.84879  1.114857
 1  X   beta  0.68161 -0.129221,
 'Y':   k1     k2     data1     data2
 2  Y  alpha  2.080715 -0.923458
 3  Y   beta -0.600653  2.113144,
 'Z':   k1     k2     data1     data2
 4  Z  alpha  0.033508  0.894159}

In [18]:
group_dict['X']

  k1     k2    data1     data2
0  X  alpha -0.84879  1.114857
1  X   beta  0.68161 -0.129221

In [19]:
group_dict_axis1 = dict(list(df.groupby(df.dtypes, axis = 1)))

In [20]:
group_dict_axis1

{dtype('float64'):       data1     data2
 0 -0.848790  1.114857
 1  0.681610 -0.129221
 2  2.080715 -0.923458
 3 -0.600653  2.113144
 4  0.033508  0.894159,
 dtype('O'):   k1     k2
 0  X  alpha
 1  X   beta
 2  Y  alpha
 3  Y   beta
 4  Z  alpha}

In [21]:
dataset2_group = df.groupby(['k1', 'k2'])[['data2']]
dataset2_group.mean()

             data2
k1 k2
X  alpha  1.114857
   beta  -0.129221
Y  alpha -0.923458
   beta   2.113144
Z  alpha  0.894159